Repository: ismatullayevs/anordating
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: ❌ Clear
ru: ❌ Очистить

source: Male 👨‍🦱
ru: Мужчина 👨‍🦱

source: Female 👩‍🦱
ru: Женщина 👩‍🦱

source: I'm looking for a man 👨‍🦱
ru: Я ищу мужчину 👨‍🦱

source: I'm looking for a woman 👩‍🦱
ru: Я ищу женщину 👩‍🦱

source: I'm looking for friends 👫
ru: Я ищу друзей 👫

source: 🔎 Watch profiles
ru: 🔎 Смотреть профили

source: 👍 Likes
ru: 👍 Вы понравились

source: ❤️ Matches
ru: ❤️ Совпадения

source: ⚙️ Settings
ru: ⚙️ Настройки

source: ✍️ Report
ru: ✍️ Пожаловаться

source: ⬅️ Menu
ru: ⬅️ Меню

source: 👤 My profile
ru: 👤 Мой профиль

source: 🔎 Search settings
ru: 🔎 Настройки поиска

source: 🌐 Language
ru: 🌐 Язык

source: ⛔️ Deactivate
ru: ⛔️ Деактивировать

source: ❌ Delete account
ru: ❌ Удалить аккаунт

source: ⏪ Rewind
ru: ⏪ Отмотать

source: 📞 Share phone number
ru: 📞 Поделиться номером телефона

source: 📍 Send location
ru: 📍 Отправить местоположение

source: City name
ru: Название города

source: ✏️ Name
ru: ✏️ Имя

source: 🔢 Birth date
ru: 🔢 Дата рождения

source: 👫 Gender
ru: 👫 Пол

source: 📝 Bio
ru: 📝 Био

source: 📍 Location
ru: 📍 Местоположение

source: 📷 Media
ru: 📷 Медиа

source: 📞 Phone number
ru: 📞 Номер телефона

source: ⬅️ Back
ru: ⬅️ Назад

source: 👩‍❤️‍👨 Gender preferences
ru: 👩‍❤️‍👨 Гендерные предпочтения

source: 🔢 Age preferences
ru: 🔢 Возрастные предпочтения

source: 📍 {dist} km
ru: 📍 {dist} км

source: Name must only contain letters and spaces
ru: Имя должно содержать только буквы и пробелы

source: Name must be at least {min_length} characters long
ru: Имя должно содержать не менее {min_length} символов.

source: Name must be less than {max_length} characters long
ru: Имя должно содержать менее {max_length} символов.

source: Bio must be less than {max_length} characters long
ru: Биография должна содержать менее {max_length} символов.

source: Please upload at least {min_length} media files
ru: Пожалуйста, загрузите медиафайл длиной не менее {min_length}.

source: You can upload up to {max_length} media files
ru: Вы можете загрузить до {max_length} медиафайлов.

source: Please enter a valid age range
ru: Пожалуйста, введите действительный возрастной диапазон

source: Age can't be lower than {min_age}
ru: Возраст не может быть ниже {min_age}

source: Age can't be higher than {max_age}
ru: Возраст не может быть больше {max_age}.

source: Minimum age needs be to lower than maximum age
ru: Минимальный возраст должен быть ниже максимального возраста.

source: Video duration can't be longer than {max_duration} seconds
ru: Видео не может быть длиннее {max_duration} секунд.

source: Hi! Please select a language
ru: Привет! Пожалуйста, выберите язык

source: Unknown command. Please use /start to start the bot.
ru: Неизвестная команда. Нажмите /start, чтобы начать бота.

source: No likes found
ru: Лайков не обнаружено

source: Likes
ru: Лайки

source: No matches found
ru: Пользователи не найдены

source: You both liked each other. You can talk to them by clicking this <a href='https://t.me/{phone_number}'>link</a>
ru: Вы оба понравились друг другу. Вы можете поговорить с ними, перейдя по этой <a href='https://t.me/{phone_number}'>ссылке</a>

source: Menu
ru: Меню

source: What's the reason for reporting this user?
ru: Какова причина жалобы на этого пользователя?

source: User has been reported
ru: На пользователя поступило сообщение

source: Settings
ru: Настройки

source: Are you sure you want to deactivate your account? No one will see your account, even the users that you liked
ru: Вы уверены, что хотите деактивировать свой аккаунт? Никто не увидит ваш аккаунт, даже те пользователи, которые вам понравились

source: Yes
ru: Да

source: No
ru: Нет

source: Activate my account
ru: Активировать мою учетную запись

source: Your account has been activated
ru: Ваша учетная запись активирована

source: Your account has been deactivated. To activate it, press the button below
ru: Ваша учетная запись была деактивирована. Чтобы активировать его, нажмите кнопку ниже

source: Choose your language
ru: Выберите свой язык

source: Are you sure you want to delete your account? All your data will be lost
ru: Вы уверены, что хотите удалить свою учетную запись? Все ваши данные будут потеряны

source: Your account has been deleted. To start again, press the button below
ru: Ваш аккаунт был удален. Чтобы начать заново, нажмите кнопку ниже

source: Start registration
ru: Начать регистрацию

source: Press the buttons below to update your profile
ru: Нажмите кнопки ниже, чтобы обновить свой профиль

source: Search settings
ru: Настройки поиска

source: Enter your name
ru: Введите свое имя

source: Your profile has been updated
ru: Ваш профиль обновлен

source: What's your birth date? Use one these formats: <b>YYYY-MM-DD</b> (For example, 2000-12-31) <b>DD.MM.YYYY</b> (For example, 31.12.2000) <b>MM/DD/YYYY</b> (For example, 12/31/2000)
ru: Какая у вас дата рождения? Используйте один из этих форматов: <b>ГГГГ-ММ-ДД</b> (например, 2000-12-31) <b>ДД.ММ.ГГГГ</b> (например, 31.12.2000) <b>ММ/ДД/ГГГГ</b> (например, 12/31/2000)

source: Select your gender
ru: Выберите свой пол

source: Tell us more about yourself. What are your hobbies, interests, etc.?
ru: Расскажите нам больше о себе. Какие у вас хобби, интересы и т. д.?

source: Who are you looking for?
ru: Какого человека вы ищете?

source: Search settings have been updated
ru: Настройки поиска обновлены

source: What is your preferred age range? (e.g. 18-25)
ru: Каков ваш предпочтительный возрастной диапазон? (например, 18–25)

source: Send your location or type the name of your city
ru: Отправьте свое местоположение или введите название своего города

source: City not found
ru: Город не найден

source: Please select your city
ru: Пожалуйста, выберите свой город

source: Please upload photos or videos of yourself ({min_media_count}-{max_media_count})
ru: Пожалуйста, загрузите свои фотографии или видео ({min_media_count}-{max_media_count})

source: Continue
ru: Продолжать

source: Please upload at least one photo
ru: Пожалуйста, загрузите хотя бы одну фотографию

source: File has been uploaded
ru: Файл загружен

source: File has been uploaded. Upload more media files if you want or press "Continue"
ru: Файл загружен. Если хотите, загрузите еще медиафайлы или нажмите "Продолжать"

source: Please share your phone number
ru: Пожалуйста, поделитесь своим номером телефона

source: Please share your own phone number
ru: Пожалуйста, поделитесь своим номером телефона

source: Hi there! I'm a bot to help you find your soulmate. Here's how it works: you'll be shown profiles of other users, and you can like or dislike them. When you like a profile, we will notify the user about it. If the user likes you back, you'll be matched and can start chatting. If you have any questions, contact our <a href='{support_link}'>support team</a>.
ru: Привет! Я бот, который поможет вам найти свою вторую половинку. Вот как это работает: вам будут показаны профили других пользователей, и вы сможете залайкать или дизлайкнуть их. Когда вы лайкнете профиль, мы уведомим пользователя об этом. Если пользователь вас тоже лайкнет, вы будете совпадать и сможете начать общение. Если у вас есть вопросы, свяжитесь с нашей <a href='{support_link}'>службой поддержки</a>.

source: Please select one of the given languages
ru: Пожалуйста, выберите один из указанных языков

source: What is your name?
ru: Как вас зовут?

source: What is your gender?
ru: Какой у вас пол?

source: Please select one of the given options
ru: Пожалуйста, выберите один из предложенных вариантов

source: Skip
ru: Пропускать

source: Please share your location or type the name of your city
ru: Пожалуйста, поделитесь своим местоположением или введите название своего города

source: Please share your location by clicking the button below
ru: Пожалуйста, поделитесь своим местоположением, нажав кнопку ниже.

source: Please share your phone number by clicking the button below
ru: Пожалуйста, поделитесь своим номером телефона, нажав кнопку ниже.

source: Registration has been completed!
ru: Регистрация завершена!

source: You can't rewind more than {rewind_limit} times
ru: Вы не можете перематывать назад более {rewind_limit} раз.

source: No more matches to rewind
ru: Больше нет профили для перемотки

source: ⏪ Rewinding
ru: ⏪ Перематываем

source: User not found
ru: Пользователь не найден

source: Congratulations. You have matched with {match.name}. You can have a chat with them by clicking this <a href='https://t.me/{match.phone_number}'>link</a> Do you want to see your matches?
ru: Поздравляем. Вы совпали с {match.name}. Вы можете поговорить с ними, перейдя по этой <a href='https://t.me/{match.phone_number}'>ссылке</a> Хотите посмотреть свои совпадения?

source: Someone liked your profile. Do you want to see who liked you?
ru: Кому-то понравился ваш профиль. Хотите узнать, кому вы понравились?

source: You are not registered!
ru: Вы не зарегистрированы!
